// Основы ООП: класс, экземпляр (обьект), интерфейс


// Функции - конструкторы
// - именование
// - оператор new
// - cвойство Function.prototype

// const Car = function (value) {
//     // 2. Функция вызываеться в контексте созданого обьекта
//     //    тоесть в this записываеться ссылка на него
//     console.log(this);

//     this.a = value;
//     // 4. ссылка на обьект возвращаеться в место вызова new Car
// }


// // 1. Если функция вызывается через new, создаеться пустой обьект
// const myCar = new Car(5);
// console.log(myCar);

// const myCar2 = new Car(10);
// console.log(myCar2);